Revit 2024 API
TableCellCalculatedValueData Members
The TableCellCalculatedValueData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TableCellCalculatedValueData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetName
 Gets the name of the calculated value.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TableCellCalculatedValueData Class
Autodesk.Revit.DB Namespace